<a href="https://colab.research.google.com/github/komal021406/ML/blob/main/Copy_of_Python_for_DS_Pandas_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Assignment

### MCQ1

### MCQ2

In [ ]:
data = {
    'Nums': [0, 1, 0, 3, 0, 5],
}

df = pd.DataFrame(data)

df

   Nums
0     0
1     1
2     0
3     3
4     0
5     5

In [ ]:
df['Nums'].replace(0, df['Nums'].mean())

0    1.5
1    1.0
2    1.5
3    3.0
4    1.5
5    5.0
Name: Nums, dtype: float64

### MCQ3

In [ ]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})

print(df1)
print()
print(df2)

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

   ID  Age
0   2   25
1   3   30
2   4   22

In [ ]:
merged_df = pd.merge(df1, df2, on='ID')
concatenated_df = pd.concat([df1, df2], axis=0)

print(merged_df)
print()
print(concatenated_df)

   ID     Name  Age
0   2      Bob   25
1   3  Charlie   30

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie   NaN
0   2      NaN  25.0
1   3      NaN  30.0
2   4      NaN  22.0

### MCQ4

In [ ]:
df = pd.DataFrame(np.random.randn(6, 4), columns=list('ABCD'))

In [ ]:
df

          A         B         C         D
0  1.732330  0.170162  0.561076 -0.188736
1  1.975203 -0.765898 -0.116659  0.581519
2 -0.468900 -0.289240 -0.488652  0.680196
3 -1.421544 -0.126406  0.425402  0.251182
4 -1.359909  0.635608 -1.680565  0.740843
5 -0.926680  2.050987 -1.835518  0.107860

In [ ]:
df[df.C > 0]

          A         B         C         D
0  1.732330  0.170162  0.561076 -0.188736
3 -1.421544 -0.126406  0.425402  0.251182

### MCQ5

In [ ]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}

In [ ]:
df = pd.DataFrame(data)

df

   A  B
0  1  4
1  2  5
2  3  6

In [ ]:
df.T

   0  1  2
A  1  2  3
B  4  5  6

### MCQ6

In [ ]:
data = {'A': [1, 2, 3, 4],
        'B': [5, 6, 7, 8]}
df = pd.DataFrame(data)

print(df)

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [ ]:
df.drop([1, 3], inplace=True)

In [ ]:
df

   A  B
0  1  5
2  3  7

In [ ]:
df.drop(['B'], axis=1, inplace=True)

In [ ]:
df

   A
0  1
2  3

### MCQ7

In [ ]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}

df = pd.DataFrame(data)

df

   A  B
0  1  4
1  2  5
2  3  6

In [ ]:
df.at[1, 'B']

5

In [ ]:
df.loc[1, 'B']

B    5
Name: 1, dtype: int64

In [ ]:
"""
the key difference between df.at and df.loc is that df.at is primarily used for
efficient access or modification of single values by label, while df.loc is a
more versatile tool for selecting, filtering, and modifying data based on labels
and conditions. Use df.at when you need to work with specific individual values,
and use df.loc when you require more complex data selection and manipulation.
"""

### MCQ8

### MCQ9

### MCQ10

In [ ]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}

df = pd.DataFrame(data)

df

   A  B
0  1  4
1  2  5
2  3  6

In [ ]:
# On all elements
df.apply(lambda x: x**2)

   A   B
0  1  16
1  4  25
2  9  36

In [ ]:
# If only on column B
df['B'] = df['B'].apply(lambda x: x**2)

df

   A   B
0  1  16
1  2  25
2  3  36

### FF1

In [ ]:
# Calculate the average rating of movies directed by Christopher Nolan
data = {
    'Title': ['Inception', 'Dunkirk', 'Interstellar', 'The Prestige', 'Memento'],
    'Director': ['Other Director', 'Christopher Nolan', 'Other Director', 'Christopher Nolan', 'Christopher Nolan'],
    'Rating': [8.8, 7.9, 8.6, 8.5, 8.4]
}

df = pd.DataFrame(data)

# df[df['Director'] == 'Christopher Nolan']
df

          Title           Director  Rating
1       Dunkirk  Christopher Nolan     7.9
3  The Prestige  Christopher Nolan     8.5
4       Memento  Christopher Nolan     8.4

In [ ]:
df.groupby('Director')['Rating'].mean()

Director
Christopher Nolan    8.266667
Other Director       8.700000
Name: Rating, dtype: float64

### FF2

In [ ]:
# Extract all rows where the price is greater than or equal to 20,000
data = {
    'Product': ['Laptop', 'Desktop', 'Tablet', 'Phone', 'Smartwatch'],
    'Price': [25000, 12000, 8000, 22000, 5000]
}

df = pd.DataFrame(data)

# Sort them in descending order by price

#
# df.where(df['Price'] >= 20000).dropna().sort_values(by='Price', ascending=False)
df[df['Price'] >= 20000].sort_values(by='Price', ascending=False)

In [ ]:
# with where

  Product    Price
0  Laptop  25000.0
3   Phone  22000.0

  Product  Price
0  Laptop  25000
3   Phone  22000

### FF3

In [ ]:
# Find the total revenue and average price of items sold in each store
data = {
    'Store': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Item': ['Apple', 'Banana', 'Orange', 'Grape', 'Apple', 'Banana', 'Orange', 'Grape'],
    'Price': [50, 20, 30, 60, 55, 22, 33, 65],
    'Quantity': [10, 12, 15, 16, 20, 25, 30, 35]
}

df = pd.DataFrame(data)

df['Revenue'] = df['Price'] * df['Quantity']

store_nums = df.groupby('Store').agg({'Revenue': 'sum', 'Price': 'mean'}).reset_index()

store_nums.rename(columns={'Price': 'Average_Price', 'Revenue': 'Total_Revenue'}, inplace=True)

store_nums

  Store  Total_Revenue  Average_Price
0     A           3040          42.00
1     B           4025          41.75

### FF4

In [ ]:
# Calculate the total amount spent by each customer
data = {
    'Customer': ['Alice', 'Bob', 'Alice', 'Alice', 'Bob', 'Bob', 'Alice', 'Bob'],
    'Item': ['Pen', 'Pencil', 'Notebook', 'Eraser', 'Pen', 'Pencil', 'Notebook', 'Eraser'],
    'Price': [10, 5, 50, 20, 10, 5, 50, 20],
    'Quantity': [3, 4, 2, 5, 10, 6, 1, 2]
}

df = pd.DataFrame(data)

df['Total_Spent'] = df['Price'] * df['Quantity']

total_amount = df.groupby('Customer')['Total_Spent'].sum().reset_index()
# total_amount = df.groupby('Customer').agg({'Total_Spent': 'sum'}).reset_index()

total_amount

  Customer  Total_Spent
0    Alice          280
1      Bob          190

### FF5

In [ ]:
# Find the month with the highest average temperature
data = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'],
    'Temperature': [20, 22, 25, 27, 30, 32, 35, 34, 30, 28, 24, 21]
}

df = pd.DataFrame(data)

max_row_idx = df['Temperature'].idxmax()

# month = df.at[max_row_idx, 'Month']
month = df.loc[max_row_idx, 'Month']

month

'Jul'

### FF6

In [ ]:
data = {

    'Category': ['Fruit', 'Vegetable', 'Fruit', 'Vegetable', 'Fruit', 'Vegetable'],

    'Name': ['Apple', 'Carrot', 'Banana', 'Potato', 'Grape', 'Onion'],

    'Price': [2, 1, 1.5, 0.5, 3, 1],

    'Quantity': [10, 20, 15, 30, 5, 40]

}



df = pd.DataFrame(data)

fruits = df[df['Category'] == 'Fruit']

total_fruit_value = fruits['Price'].sum() * fruits['Quantity'].sum()

df

    Category    Name  Price  Quantity
0      Fruit   Apple    2.0        10
1  Vegetable  Carrot    1.0        20
2      Fruit  Banana    1.5        15
3  Vegetable  Potato    0.5        30
4      Fruit   Grape    3.0         5
5  Vegetable   Onion    1.0        40

### FF7

In [ ]:
data = {

    'Name': ['Alice', 'Bob', 'Charlie', 'David'],

    'Age': [25, 30, 35, 40],

    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']

}



df = pd.DataFrame(data)

result = df[df['Age'] >= 30].sort_values(by='Age', ascending=False).iloc[0]['City']

print(result)

Chicago

### FF8

In [ ]:
data = {

    'Product': ['A', 'B', 'C', 'A', 'B', 'C'],

    'Price': [100, 200, 300, 150, 250, 350],

    'Quantity': [10, 5, 7, 12, 8, 5]

}



df = pd.DataFrame(data)

df

  Product  Price  Quantity
0       A    100        10
1       B    200         5
2       C    300         7
3       A    150        12
4       B    250         8
5       C    350         5

In [ ]:
total_revenue = (df['Price'] * df['Quantity']).sum()

total_revenue

9650

In [ ]:
average_price = df['Price'].mean()

average_price

225.0

### FF9

In [ ]:
# Find the total amount spent per item, as well as the total amount spent by all customers
data = {
    'Customer': ['Alice', 'Bob', 'Alice', 'Alice', 'Bob', 'Bob', 'Alice', 'Bob'],
    'Item': ['Pen', 'Pencil', 'Notebook', 'Eraser', 'Pen', 'Pencil', 'Notebook', 'Eraser'],
    'Price': [10, 5, 50, 20, 10, 5, 50, 20],
    'Quantity': [3, 4, 2, 5, 10, 6, 1, 2]
}

df = pd.DataFrame(data)

df['Total_Spent'] = df['Price'] * df['Quantity']

# per_item = df.groupby('Item')['Total_Spent'].sum().reset_index()
per_item = df.groupby('Item').agg({'Total_Spent': 'sum'}).reset_index()

# total = df['Total_Spent'].sum()
total = per_item['Total_Spent'].sum()

print(per_item)
print()
print(total)

       Item  Total_Spent
0    Eraser          140
1  Notebook          150
2       Pen          130
3    Pencil           50

470

### FF10

In [ ]:
# Calculate the monthly average temperature difference between two cities
data = {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'],
    'City_A_Temp': [20, 22, 25, 27, 30, 32, 35, 34, 30, 28, 24, 21],
    'City_B_Temp': [10, 12, 15, 17, 20, 22, 25, 24, 20, 18, 14, 11]
}

df = pd.DataFrame(data)

df['Difference'] = abs(df['City_A_Temp'] - df['City_B_Temp'])

difference_mean = df['Difference'].mean()

print(df)
print()
print(difference_mean)

   Month  City_A_Temp  City_B_Temp  Difference
0    Jan           20           10          10
1    Feb           22           12          10
2    Mar           25           15          10
3    Apr           27           17          10
4    May           30           20          10
5    Jun           32           22          10
6    Jul           35           25          10
7    Aug           34           24          10
8    Sep           30           20          10
9    Oct           28           18          10
10   Nov           24           14          10
11   Dec           21           11          10

10.0